* Project Euler
** Problem 1 - [Mutiples of 3 or 5]
#+begin_src python
  return sum([n for n in range(1000) if n % 3 == 0 or n % 5 == 0])
#+end_src

#+RESULTS:
: 233168

** Problem 2
#+begin_src python
    a, b = 1, 1
    fib_sum = 0
    while a < 4*10**6:
        if a%2 == 0:
            fib_sum += a
        a, b = b, a + b
    return fib_sum
#+end_src

#+RESULTS:
: 4613732
